package sec1;

public class Example5 {
    public static void main(String[] args) {

        //언더플로우 : 해당 표현범위보다 작음
        //오버플로우 : 해당 표현범위보다 큼

        int i1 = 104;
        //int i2 = -2147483649; -> 언더플로우
        //int i3 = 2147483648; -> 오버플로우

        char c1 = 104;
        //char c2 = -1; -> 언더플로우
        //char c3 = 65536; -> 오버플로우

        byte b1 = 104;
        //byte b2 = -129; -> 언더플로우
        //byte b3 = 128;  -> 오버플로우

        short s1 = 104;
        //short s2 = -32769; -> 언더플로우
        //short s3 = 32768; -> 오버플로우

        long l1 = 104;
        //long l2 = -2147483649; -> 언더플로우
        //long l3 = 2147483648; -> 오버플로우

        float f1 = 104;
        //float f2 = -2147483649; -> 언더플로우
        //float f3 = 2147483648; -> 오버플로우

        double d1 = 104;
        //double d2 = -92233720368500000000000000000; -> 언더플로우
        //double d3 = 92233720368500000000000000000; -> 오버플로우

    }
}